#include<stdio.h>
char map[1000][1000];
//line---n   number of -or# each line---m
int dx[12]={ 0,1,0,-1,0,2, 0,-2,1,-1,-1, 1};
int dy[12]={-1,0,1, 0,2,0,-2, 0,1, 1,-1,-1};
int m,n;
void dfs(int x,int y)
{
    int i,newx,newy;
    map[x][y]='-';
    for(i=0;i<12;i++)
    {
        newx=x+dx[i];
        newy=y+dy[i];
        if(newx>=1 && newx<=n && newy>=0 && newy<m && map[newx][newy]=='#')
            dfs(newx,newy);
    }
}

int main()
{
    int j,i,ans=0;
    scanf("%d%d",&n,&m);
    for(i=1;i<=n;i++)
        scanf("%s",map[i]);
    for(i=1;i<=n;i++)
        for(j=0;j<=m-1;j++)
            if(map[i][j]=='#')
             {
                dfs(i,j);
                ans++;
             }  

    printf("%d\n",ans);
    system("pause");
    return 0;
}
/*
圣诞夜的极光
描述 Description
人造极光其实就是空中的一幅幅n*m的点阵图像。只是因为特别明亮而吸引了很多很多小精
灵的目光，也成为了圣诞夜最美丽的一刻。
然而在每幅n*m的点阵图像中，每一个点只有发光和不发光两种状态。对于所有的发光的点
，在空中就形成了美丽的图画。而这个图画是以若干个（s个）图案组成的。对于图案，圣
诞老人有着严格的定义：对于两个发光的点，如果他们的曼哈顿距离（对于A(x1,y1)和B(x2,y2)，
A和B之间的曼哈顿距离为|x1-x2|+|y1-y2|）小于等于2。那么这两个点就属于一个图案……
小精灵们一边欣赏着极光，一边数着每一幅极光图像中的图案数。伴着歌声和舞蹈，度过了美丽的圣诞之夜

输入格式 Input Format
第一行，两个数n和m。
　　接下来一共n行，每行m个字符。对于第i行第j个字符，如果其为“-”，那么表示
    该点不发光，如果其为“#”，那么表示该点发光。不可能出现其他的字符
输出格式 Output Format
第一行，一个数s
样例输入 Sample Input
19 48
------------------------------------------------
---####-----#-----#----------------------####---
--######----#-----#---------------------######--
-########--#-#---#-#####--#-##-##---#--########-
-###--###--#-#---#-#----#-##-##--#--#--###--###-
-###--###--#--#-#--######-#--#---#-#---###--###-
-########--#--#-#--#------#--#----##---########-
--######---#---#---######-#--#-----#----######--
---####----------------------------#-----####---
----------------------------------#-------------
------------------------------------------------
---###--#--------#------#-----------------------
--#---#-#---------------#-----------------------
-#------#-##--#-##--##-###-#-##-###--###-#--##--
-#------##--#-##-#-#----#--##--#---##---##-#----
-#------#---#-#--#--#---#--#---#---##----#--#---
--#---#-#---#-#--#---#--#--#---#---##---##---#--
---###--#---#-#--#-##---#--#---#---#-###-#-##---
------------------------------------------------
4


*/
/*
if(map[x][i]=='#' && map[x][i+1]=='#') dfs(x,i+1);
if(map[x][i]=='#' && map[x][i+2]=='#') dfs(x,i+2);
if(map[x][i]=='#' && map[x+1][i]=='#') dfs(x+1,i);
if(map[x][i]=='#' && map[x+1][i+1]=='#') dfs(x+1,i+1);
if(map[x][i]=='#' && map[x+1][i-1]=='#') dfs(x,i+1);
*/
/****#***
****###******
***##0##*****
****###********
*****#**********
*/
